{
  "herov1": {
    "title": "TURN",
    "title2": "ATTENTION",
    "title3": "into",
    "titles": ["Growth.", "Flawless Events."],
    "desc": "We help brands grow through data-driven strategy, creative storytelling, and measurable performance.",
    "button": {
      "btn1": "Let’s Work Together",
      "btnurl1": "#"
    },
    "img": "/assets/img/hero.png"
  },
  "aboutIntro": {
    "bgImg": "/assets/img/bg-about.png",
    "title": "Who We Are",
    "desc": "Blaze Media is an innovative marketing and events agency dedicated to helping businesses grow. We create impactful campaigns and unforgettable experiences that connect brands with the right audience and deliver real impact.\n\nWe believe in building strong partnerships with our clients, understanding their unique needs, and creating tailored solutions that exceed expectations.",
    "cards": [
      {
        "title": "Vision",
        "desc": "To be the leading marketing and events agency recognized for creativity, strong execution, and consistent results for our clients."
      },
      {
        "title": "Mission",
        "desc": "To help businesses grow through focused marketing strategies and well-executed event experiences that elevate their brand and increase their revenue."
      },
      {
        "title": "Promise",
        "desc": "Connecting the right audiences. Delivering real growth."
      }
    ]
  },
  "aboutSection": {
    "leftSection": {
      "title": "Who We Are",
      "desc": "We are a passionate team of creative professionals dedicated to transforming brands through innovative digital solutions. With years of experience across marketing, design, and development, we understand what it takes to make your brand stand out in today's competitive landscape."
    },
    "rightSection": {
      "title": "Our Vision",
      "desc": "We create digital experiences that captivate audiences and drive measurable business growth for ambitious brands. Every project is an opportunity to blend creativity with strategy, ensuring your brand not only looks exceptional but also performs exceptionally in the digital space."
    }
  },
  "about": {
    "sectionHeading": {
      "title": "Our <span>Work</span>",
      "desc": "A selection of our impactful projects that drive results and transformations."
    },
    "projects": [
      {
        "title": "InCompass",
        "desc": "Technology company branding and digital marketing solutions for innovation leadership."
      },
      {
        "title": "ALMASA Real Estate",
        "desc": "Complete digital transformation and brand identity for luxury real estate development."
      },
      {
        "title": "CCI",
        "desc": "Comprehensive brand development and marketing strategy for corporate consulting firm."
      },
      {
        "title": "Century Capital",
        "desc": "Financial services brand identity and digital presence that established market trust."
      },
      {
        "title": "JEDAR Real Estate",
        "desc": "Premium real estate brand identity and marketing campaigns for luxury properties."
      }
    ]
  },
  "contact": {
    "leftSection": {
      "title": "Get in touch",
      "subtitle": "Let's build something great.",
      "desc": "Whatever you have in mind for your project or if you just want to explore possibilities, we would love to hear from you."
    },
    "form": {
      "title": "Send us a message",
      "submitBtnLabel": "Send Message"
    }
  },
  "funfacts": {
    "bgImg": "/assets/img/counter-bg.jpg",
    "facts": [
      {
        "title": "Faster",
        "icon": "pe-7s-magic-wand",
        "number": "100",
        "unit": "%"
      },
      {
        "title": "Cup of Coffee",
        "icon": "pe-7s-coffee",
        "number": "900"
      },
      {
        "title": "Active Clients",
        "icon": "pe-7s-check",
        "number": "10000"
      },
      {
        "title": "Peoples Love",
        "icon": "pe-7s-like",
        "number": "1276"
      }
    ]
  },
  "accordion": {
    "sectionHeading": {
      "title": "Frequently Asked <span>Questions</span>",
      "desc": "Get answers to the most common questions about our services and process."
    },
    "image": "/assets/img/faq.png",
    "accordionContent": [
      {
        "title": "What services does Blaze Media offer?",
        "content": "Blaze Media provides full marketing solutions including:\n- Social media management\n- Content creation (design, video, copywriting)\n- Paid ads (Meta, Google, TikTok)\n- Branding & visual identity\n- Marketing strategy & consulting"
      },
      {
        "title": "Do you offer customized marketing plans?",
        "content": "Yes! Every brand is different, so we create tailored strategies based on your goals, budget, and target audience."
      },
      {
        "title": "How long does it take to see results?",
        "content": "It depends on the service, but generally:\n- Branding & content: visible improvement within the first month\n- Paid ads & growth campaigns: results usually start showing within 2-4 weeks\n\nMarketing is a process—not magic, but we make it effective."
      },
      {
        "title": "Do you handle everything or just social media?",
        "content": "We can do both.\nYou can choose:\n- A single service (like social media or ads)\n- Or a full marketing package where we handle everything end-to-end"
      },
      {
        "title": "How do we start working together?",
        "content": "Simple:\n- Contact us\n- We schedule a quick call\n- We understand your needs\n- We send a proposal\n- Let the magic begin"
      },
      {
        "title": "What makes Blaze Media different?",
        "content": "Creative thinking + data-driven strategy.\nClear communication.\nA team that treats your brand like it’s their own.\nWe don’t just market—we build brands."
      },
      {
        "title": "Can you work with our existing brand identity?",
        "content": "Absolutely. We can either develop a new identity or enhance what you already have."
      }
    ]
  },
  "features": {
    "sectionHeading": {
      "title": "OUR <span>SERVICES</span>",
      "desc": "We combine strategy, creativity, and performance to build marketing that works."
    },
    "singleFeature": {
      "featurePart1": [
        {
          "title": "Markitchen",
          "icon": "/assets/img/portfolio/markitchen.png",
          "desc": "Digital Marketing that maximizes presence and ROI across all platforms.",
          "btnText": "Learn More"
        },
        {
          "title": "LeadGen",
          "icon": "/assets/img/portfolio/lead-gen.png",
          "desc": "Lead generation campaigns designed to identify and convert qualified leads into sales-ready prospects.",
          "btnText": "Learn More"
        },
        {
          "title": "Event Essentials",
          "icon": "/assets/img/portfolio/event-essentials.png",
          "desc": "Where event planning, execution, and experience come together.",
          "btnText": "Learn More"
        }
      ]
    }
  },
  "work": {
    "sectionHeading": {
      "title": "OUR PORTFOLIO",
      "desc": "A selection of projects that demonstrate how we turn strategy into measurable results."
    },
    "projects": [
      {
        "title": "Incompass",
        "description": "Building a strong market presence from an early startup stage required clear brand positioning, high digital visibility, and effective lead generation in a competitive real estate market.",
        "backText": "Blaze Media partnered with Incompass from its early stage to build the brand identity and establish a strong digital presence, implementing well-planned, performance-driven real estate marketing strategies."
      },
      {
        "title": "CCI",
        "description": "Strengthening CCI's position in the real estate resale market required a clear brand identity, strong digital visibility, and consistent generation of qualified leads in a competitive market.",
        "backText": "Blaze Media partnered with CCI to build a strong brand identity and establish a solid digital presence, implementing well-planned, performance-driven marketing strategies tailored to the real estate resale market."
      },
      {
        "title": "DAMAC",
        "description": "Entering the Egyptian market required strong brand positioning, high visibility, and qualified lead generation for real estate exhibitions and advertising campaigns.",
        "backText": "Blaze Media delivered performance-driven marketing strategies combining strong digital presence, precise targeting, and optimized campaigns to generate qualified leads and increase brand visibility in the Egyptian real estate market."
      },
      {
        "title": "AL MASA",
        "description": "Strengthening AL MASA's position in the real estate resale market required a clear brand identity, strong digital visibility, and consistent generation of qualified leads.",
        "backText": "Blaze Media developed performance-driven marketing strategies focused on building a strong digital presence, precise audience targeting, and optimized campaigns tailored to the resale real estate market."
      },
      {
        "title": "JADER Real Estate",
        "description": "Driving sales within a specific location required high market visibility, precise audience targeting, and effective lead generation in the competitive Sheikh Zayed real estate market.",
        "backText": "Blaze Media managed performance-driven paid advertising campaigns focused exclusively on the Sheikh Zayed area, utilizing precise targeting, optimized creatives, and continuous campaign optimization."
      },
      {
        "title": "ArchITechs",
        "description": "Driving measurable growth in the competitive IT market required enhanced digital visibility, precise targeting of key B2B decision-makers, and consistent generation of qualified leads.",
        "backText": "Blaze Media acted as a marketing partner by delivering performance-driven paid advertising strategies that enhanced digital visibility, targeted key B2B decision-makers, and consistently generated qualified leads, driving measurable growth in a competitive IT market."
      }
    ]
  }
}
